server/app/controllers/api/v1/notes_controller.rb

      def query
        key = params[:key]
        val = params[:value]

        if key.blank? || val.blank?
          return render json: { error: "Parameters 'key' and 'value' are required" }, status: :bad_request
        end

        results = current_vault.notes.query_frontmatter(key, val)
        render json: {
          query: { key: key, value: val },
          count: results.size,
          notes: results.map { |n| serialize_note(n) }
---
SELECT "notes".* FROM "notes" WHERE "notes"."vault_id" = ? AND "notes"."deleted_at" IS NULL  [["vault_id", "2b76ad6d-05db-4ba4-81dc-5f8ee5fb7731"]]