server/app/controllers/api/v1/sync_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."vault_id" = ? AND "notes"."relative_path" = ? LIMIT ?  [["vault_id", "d0c7918c-8583-4004-bcee-b234615d802d"], ["relative_path", "01_Daily/2026-09-02.md"], ["LIMIT", 1]]
---
      def delta
        client_since = params[:since].present? ? Time.parse(params[:since]) : nil
        incoming_deltas = params[:deltas] || []

        applied_count = 0

        Note.transaction do
          incoming_deltas.each do |d|
            note = current_vault.notes.find_or_initialize_by(relative_path: d[:relative_path])